Merge pull request #382 from mosejong/mosejong
refactor: 포폴용 코드 정리 + README 개선
